qwen25-coder/XML/50848.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"\n                    xmlns:xsd="http://www.w3.org/2001/XMLSchema"\n                    xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"\n                    xmlns:ser="http://tempuri.org/">\n   <soapenv:Header/>\n   <soapenv:Body>\n      <ser:convert>\n         <!--Optional:-->\n         <pInput>testData</pInput>\n      </ser:convert>\n   </soapenv:Body>\n</soapenv:Envelope>